app/controllers/charges_controller.rb

	def create
	  product = Product.find(params[:product_id])

	  customer = Stripe::Customer.create(
	    :email => params[:stripeEmail],
	    :card  => params[:stripeToken],
	    :plan  => "ghacker2"
	  )

# charge = Stripe::Charge.create(
# 	    :customer    => customer.id,
# 	    :amount      => product.price_in_cents,
# 	    :description => product.full_description,
# 	    :currency    => 'usd'
#
#	  )

	  purchase = Purchase.create(email: params[:stripeEmail],
	  	card: params[:stripeToken], amount: product.price_in_cents,
	  	description: product.full_description, currency: 'usd',
	  	customer_id: customer.id, product_id: product.id, uuid: SecureRandom.uuid)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "purchases" ("email", "card", "amount", "description", "currency", "customer_id", "product_id", "uuid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)