app/controllers/products_controller.rb

	def index
  		@products = Product.all
---
SELECT "products".* FROM "products"

	def show
		@product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]