app/controllers/purchases_controller.rb

	def show
		@purchase = Purchase.find_by_uuid(params[:id])
		@product = Product.find(@purchase.product_id)
---
SELECT  "purchases".* FROM "purchases" WHERE "purchases"."uuid" = ? LIMIT 1  [["uuid", "c8db13c0-1844-49fb-aced-80a3cfffc8da"]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]